experiments/random/outputs/false_N750k_D25_K32.txt
pgbench (14.8 (Homebrew), server 15.3 (Debian 15.3-1.pgdg120+1))
transaction type: -
scaling factor: 1
query mode: simple
number of clients: 5
number of threads: 5
number of transactions per client: 10
number of transactions actually processed: 50/50
latency average = 1219.139 ms
initial connection time = 15.424 ms
tps = 4.101256 (without initial connection time)
statement latencies in milliseconds:
         0.015  \SET id random(1, 10000)
      1184.099  SELECT *