experiments/random/outputs/true_N500k_D5_K16.txt
pgbench (14.8 (Homebrew), server 15.3 (Debian 15.3-1.pgdg120+1))
transaction type: -
scaling factor: 1
query mode: simple
number of clients: 5
number of threads: 5
number of transactions per client: 10
number of transactions actually processed: 50/50
latency average = 25.291 ms
initial connection time = 18.169 ms
tps = 197.695659 (without initial connection time)
statement latencies in milliseconds:
         0.007  \SET id random(1, 10000)
        22.413  SELECT *